In [1]:
import pandas as pd
df = pd.read_csv('datasets/df.csv')
df

     gh owner language      repo  stars
0  pandas-dev   python    pandas  17800
1   tidyverse        R     dplyr   2800
2   tidyverse        R   ggplot2   3500
3      has2k1   python  plotnine   1450

In [2]:
#Consider the Pandas DataFrame df below. Remove the column named "repo".

df.drop(columns='repo')

     gh owner language  stars
0  pandas-dev   python  17800
1   tidyverse        R   2800
2   tidyverse        R   3500
3      has2k1   python   1450

In [3]:
#Consider the Pandas DataFrame df below. Filter it appropriately so that it outputs the shown results.

df[df['stars'] == 1450]

  gh owner language      repo  stars
3   has2k1   python  plotnine   1450

In [4]:
df.language

0    python
1         R
2         R
3    python
Name: language, dtype: object

In [5]:
df[['repo', 'gh owner']]

       repo    gh owner
0    pandas  pandas-dev
1     dplyr   tidyverse
2   ggplot2   tidyverse
3  plotnine      has2k1

In [6]:
import pandas as pd
wine = pd.read_csv('datasets/wine.csv')

#From the wine DataFrame, select the columns country and price.

subset_wine = wine[['country', 'price']]

print(subset_wine.head())

     country  price
0  argentina  19.04
1  argentina  18.49
2   portugal  18.99
3    germany  16.95
4      italy  17.99

In [7]:
tv_show = pd.read_csv('datasets/tv_show.csv')
tv_show

           title  seasons
0     Queen Sono        1
1          Elite        3
2   Black Mirror        5
3  Sex Education        2
4      Girl Boss        1

In [8]:
country = pd.read_csv('datasets/country.csv')
country

                  title country_of_origin language
0            Queen Sono      South Africa  English
1                 Elite             Spain  Spanish
2          Black Mirror    United Kingdom  English
3  The House of Flowers            Mexico  Spanish
4             Girl Boss     United States  English

In [9]:
#Merge the tv_show and country DataFrames while keeping all rows of the tv_show DataFrame.

print(pd.merge(tv_show, country, on = 'title', how = 'left'))

           title  seasons country_of_origin language
0     Queen Sono        1      South Africa  English
1          Elite        3             Spain  Spanish
2   Black Mirror        5    United Kingdom  English
3  Sex Education        2               NaN      NaN
4      Girl Boss        1     United States  English

In [10]:
#The wine DataFrame, whose first few rows are shown below, provides information on wine stocked by an online retailer, but is
#missing the year of the vintage. Add the year column to the data. The list of years has been created for you.

year = [2018, 2018, 2017, 2016, 2017, 2016, 2018, 2016, 2016]

wine['year'] = year 

print(wine.head())

          style   type    country  price  rating  year
0        malbec    red  argentina  19.04     4.2  2018
1        malbec    red  argentina  18.49     4.2  2018
2     alvarinho  white   portugal  18.99     4.2  2017
3      riesling  white    germany  16.95     4.0  2016
4  valpolicella    red      italy  17.99     4.2  2017

In [11]:
s = pd.Series(['red', 'blue', 'red'])
s

0     red
1    blue
2     red
dtype: object

In [12]:
s.str.startswith('re')

0     True
1    False
2     True
dtype: bool

In [13]:
df_1 = pd.read_csv('datasets/df_1.csv')
df_1

   repo_id language  stars
0        1   python   1450
1        2        R   2800

In [14]:
df_2 = pd.read_csv('datasets/df_2.csv')
df_2

   repo_id      repo    gh owner
0        1  plotnine      has2k1
1        3    pandas  pandas-dev

In [15]:
import numpy as np
df_3 = pd.merge(df_1, df_2, on = "repo_id", how = 'outer')
df_3

   repo_id language   stars      repo    gh owner
0        1   python  1450.0  plotnine      has2k1
1        2        R  2800.0       NaN         NaN
2        3      NaN     NaN    pandas  pandas-dev

In [16]:
df_3 = pd.read_csv('datasets/df_3.csv')
df_3

   x   y
0  4  16
1  9  25

In [17]:
df_3.apply(lambda col: col * 10)

    x    y
0  40  160
1  90  250

In [18]:
data = pd.Series([1, 2, np.nan, 4, 5])
data.fillna(0)

0    1.0
1    2.0
2    0.0
3    4.0
4    5.0
dtype: float64

In [19]:
df_4 = pd.read_csv('datasets/df_4.csv')
df_4

   customer_id  order_id
0           20         5
1           21         6
2           22         7

In [20]:
df_5 = pd.read_csv('datasets/df_5.csv')
df_5

   customer_id customer_firstname customer_lastname     customer_email
0           20               Jane            Yellow  jane@datacamp.com
1           21               John              Blue  john@datacamp.com
2           23                Joe             Green   joe@datacamp.com

In [21]:
#Consider the Pandas DataFrames df_1 and df_2, below. Complete the code so that you join df_2 to df_1, retaining the rows that
#are in both DataFrames.

pd.merge(df_4, df_5, on = "customer_id", how = 'inner')

,customer_id,order_id,customer_firstname,customer_lastname,customer_email
0,20,5,Jane,Yellow,jane@datacamp.com
1,21,6,John,Blue,john@datacamp.com

In [22]:
df = pd.read_csv('datasets/df.csv')
df

     gh owner language      repo  stars
0  pandas-dev   python    pandas  17800
1   tidyverse        R     dplyr   2800
2   tidyverse        R   ggplot2   3500
3      has2k1   python  plotnine   1450

In [23]:
df.pivot_table(values = 'stars', index = 'language', aggfunc = np.sum)

          stars
language
R          6300
python    19250

In [24]:
df[(df["language"] == "python") & (df["stars"] > 5000)]

     gh owner language    repo  stars
0  pandas-dev   python  pandas  17800

In [25]:
s1 = pd.Series(['red', 'blue', 'yellow'], index = [1, 2, 3])
s1

1       red
2      blue
3    yellow
dtype: object

In [26]:
s2 = pd.Series(['purple', 'green', 'orange'], index = [4, 5, 6])
s2

4    purple
5     green
6    orange
dtype: object

In [27]:
pd.concat([s1, s2])

1       red
2      blue
3    yellow
4    purple
5     green
6    orange
dtype: object

In [28]:
data = pd.read_csv('datasets/data.csv')
data

        bmi      country   year
0  21.48678  Afghanistan  Y1980
1       NaN      Albania  Y1980
2  21.46552  Afghanistan  Y1981
3       NaN      Albania  Y1981

In [29]:
data.isna()
#data.isnull()

     bmi  country   year
0  False    False  False
1   True    False  False
2  False    False  False
3   True    False  False

In [30]:
chess = pd.read_csv('datasets/chess.csv', sep=';')
chess

   Fide id                     Name Federation  Year_of_birth Title  Gender
0   700070            Polgar, Judit        HUN           1976    GM  female
1  8602980               Hou, Yifan        CHN           1994    GM  female
2  5008123            Koneru, Humpy        IND           1987    GM  female
3  4147103  Goryachkina, Aleksandra        RUS           1998    GM  female
4   700088            Polgar, Susan        HUN           1969    GM  female

In [31]:
#The chess dataset contains information about the top female chess players around the world. Remove the redundant Gender column
#from the dataset.

chess.drop(columns="Gender", inplace=True)

chess.dtypes

Fide id           int64
Name             object
Federation       object
Year_of_birth     int64
Title            object
dtype: object

In [32]:
chess = chess.set_index('Fide id')

chess.head()

                            Name Federation  Year_of_birth Title
Fide id
700070             Polgar, Judit        HUN           1976    GM
8602980               Hou, Yifan        CHN           1994    GM
5008123            Koneru, Humpy        IND           1987    GM
4147103  Goryachkina, Aleksandra        RUS           1998    GM
700088             Polgar, Susan        HUN           1969    GM

In [33]:
food = df

#The food DataFrame contains nutritional information about six menu items from a restaurant. Print the row index of the data.

print(food.index)

Int64Index([0, 1, 2, 3], dtype='int64')

In [34]:
df_6 = pd.read_csv('datasets/df_6.csv')
df_6

        bmi      country   year
0  21.48678  Afghanistan  Y1980
1  25.22533      Albania  Y1980
2  21.46552  Afghanistan  Y1981
3  25.23981      Albania  Y1981

In [35]:
df_6.pivot_table(index = "country", columns = "year", values = "bmi")

year            Y1980     Y1981
country
Afghanistan  21.48678  21.46552
Albania      25.22533  25.23981

In [36]:
df_7 = pd.read_csv('datasets/df_7.csv')
df_7

   x   y
0  4  16
1  9  25

In [37]:
df_7.apply(np.sqrt)

     x    y
0  2.0  4.0
1  3.0  5.0

In [38]:
#The chess dataset contains information about the top female chess players around the world. The Federation column indicates
#which country the player represents. How many players are from each country?

players_per_country = chess['Federation'].value_counts()

players_per_country.head()

HUN    2
RUS    1
IND    1
CHN    1
Name: Federation, dtype: int64

In [39]:
df_8 = pd.read_csv('datasets/df_8.csv')
df_8

   id treatment  response
0   1         a        12
1   2         a        52
2   3         b        45

In [40]:
df_8.pivot_table(index = "id", values = "response", columns = "treatment")

treatment     a     b
id
1          12.0   NaN
2          52.0   NaN
3           NaN  45.0

In [41]:
df_9 = pd.read_csv('datasets/df_9.csv')
df_9

       repo    gh owner language  stars  commits
0    pandas  pandas-dev   python  17800      133
1     dplyr   tidyverse        R   2800       52
2   ggplot2   tidyverse        R   3500       59
3  plotnine      has2k1   python   1450       38

In [42]:
df_9.groupby("language")[['stars', 'commits']].agg(['min', 'max', 'sum'])

         stars               commits
           min    max    sum     min  max  sum
language
R         2800   3500   6300      52   59  111
python    1450  17800  19250      38  133  171

In [43]:
import datetime as dt

start = dt.datetime(2010, 10, 5, 13, 30, 2)
delta = dt.timedelta(seconds = 2)

print(start + delta)

2010-10-05 13:30:04

In [44]:
#The chess dataset contains information about the top female chess players around the world. You have viewed the first rows of
#the dataset but you suspect some of the subsequent rows might very different. Preview a random sample of 5 rows. Ensure that
#you have reproducible results by using a random_state=42.

chess.sample(n=5, random_state=42)

                            Name Federation  Year_of_birth Title
Fide id
8602980               Hou, Yifan        CHN           1994    GM
700088             Polgar, Susan        HUN           1969    GM
5008123            Koneru, Humpy        IND           1987    GM
700070             Polgar, Judit        HUN           1976    GM
4147103  Goryachkina, Aleksandra        RUS           1998    GM

In [45]:
import numpy as np
import pandas as pd

data = pd.Series([1, 2, np.nan, 4, np.nan])
data.fillna(method = "ffill")

0    1.0
1    2.0
2    2.0
3    4.0
4    4.0
dtype: float64

In [46]:
#Consider the Pandas DataFrames df_1 and df_2, below. Complete the code so that you join df_2 to df_1, and retain all of the
#rows in both DataFrames.

pd.merge(df_4, df_5, on = "customer_id", how = 'outer')

,customer_id,order_id,customer_firstname,customer_lastname,customer_email
0,20,5.0,Jane,Yellow,jane@datacamp.com
1,21,6.0,John,Blue,john@datacamp.com
2,22,7.0,NaN,NaN,NaN
3,23,NaN,Joe,Green,joe@datacamp.com

In [47]:
from datetime import date

d = date(2020, 2, 10)

d.strftime("%Y/%m/%d")

'2020/02/10'

In [48]:
import pandas as pd

s.str.endswith("d")

0     True
1    False
2     True
dtype: bool

In [49]:
import pandas as pd
df = pd.read_csv('datasets/df.csv')

df.loc[:,'id'] = [1,2,3,4]
print(df)

     gh owner language      repo  stars  id
0  pandas-dev   python    pandas  17800   1
1   tidyverse        R     dplyr   2800   2
2   tidyverse        R   ggplot2   3500   3
3      has2k1   python  plotnine   1450   4

In [50]:
df_10 = pd.read_csv('datasets/df_10.csv')
df_10

      ingredient quantity
0         butter    125 g
1          cream    1 cup
2  caramel treat    360 g

In [51]:
df_11 = pd.read_csv('datasets/df_11.csv')
df_11

                   ingredient quantity
0             tennis biscuits    125 g
1  peppermint crisp chocolate    1 cup

In [52]:
print(pd.concat([df_10, df_11], axis=0))

                   ingredient quantity
0                      butter    125 g
1                       cream    1 cup
2               caramel treat    360 g
0             tennis biscuits    125 g
1  peppermint crisp chocolate    1 cup

In [53]:
#Complete the code to return the output

import datetime as dt

start = dt.datetime(2010, 10, 5, 13, 30, 2)
delta = dt.timedelta(seconds = 2)

print(start + delta)

2010-10-05 13:30:04

In [2]:
age = [1,2,3,4,5,6,7,8,9,10]

#You have collected data on the age for each of 100 shoppers in your store. Calculate the standard deviation for the age of the
#shoppers.

#Complete the code to return the output

import numpy as np

sd_age = np.std(age)

print(sd_age.round(2))

2.87

In [4]:
import pandas as pd
df_12 = pd.read_csv('datasets/df_12.csv')

#Consider the Pandas DataFrame df below.

print(df_12, '\n')

#Complete the code to return the output

print(df_12.loc['two':])

      Month  Count
zero    Jan     52
one     Apr     29
two     Mar     46
three   Feb      3

      Month  Count
two     Mar     46
three   Feb      3

In [6]:
import pandas as pd
df_13 = pd.read_csv('datasets/df_13.csv')

#Subset the DataFrame df to select the alignment and character columns.

print(df_13, '\n')

#Complete the code to return the output

import pandas as pd

print(df_13[['alignment', 'character']])

  alignment     character  height    location
0      Good        Batman    1.88      Gotham
1      Good  Wonder Woman    1.78  Themyscira
2      Evil    Lex Luthor    1.88  Metropolis
3      Evil     The Joker    1.85      Gotham

  alignment     character
0      Good        Batman
1      Good  Wonder Woman
2      Evil    Lex Luthor
3      Evil     The Joker

In [ ]:
#Subset the Pandas DataFrame df shown below to return all rows with a weight greater than 175.

     species   name  weight
0       lion  Sally     121
1      tiger  Henry     228
2       lion   Tony     177
3      tiger   Lucy     165

#Select the code to return the output

print(df[df.weight > 175])

In [ ]:
#Return the Pandas DataFrame df shown below with the smallest salary value appearing first in the data frame.

     first name   gender     salary  
0         Linda   female       3400  
1         Steve     male       5000 
2         Henry     male      12400
3          Sara   female       7600  

#Complete the code to return the output

result = df.sort_values('salary', ascending = True)
print(result)

In [ ]:
#Consider the Pandas DataFrame df below. Filter it appropriately so that it outputs the shown results.

     gh owner language      repo  stars
0  pandas-dev   python    pandas  17800
1   tidyverse        R     dplyr   2800
2   tidyverse        R   ggplot2   3500
3      has2k1   python  plotnine   1450

#Complete the code to return the output

print(df[df["stars"]==1450])

In [ ]:
#Consider the Pandas DataFrame df below:

     gh owner language      repo  stars
0  pandas-dev   python    pandas  17800
1   tidyverse        R     dplyr   2800
2   tidyverse        R   ggplot2   3500
3      has2k1   python  plotnine   1450

#Complete the code to return the output

import pandas as pd

print(df.stars.transform(lambda x: x / 1000))

In [ ]:
#Consider the Pandas DataFrame df below.

     gh owner language      repo  stars
0  pandas-dev   python    pandas  17800
1   tidyverse        R     dplyr   2800
2   tidyverse        R   ggplot2   3500
3      has2k1   python  plotnine   1450

#Complete the code to return the output

print(df.loc[:,["gh owner"]])

In [ ]:
#Calculate the variance and standard deviation of the array x.

#Complete the code to return the output

x = np.array([2.2, 0.9, 4.4, 6.7, 2.8, 3.2, 1.1, 3.5])
x_var = np.var(x)
x_stdev = np.std(x)
print('Variance: {:4.2f}'.format(x_var))
print('Std Deviation: {:4.2f}'.format(x_stdev))

In [ ]:
#The wine DataFrame provides information on wines stocked by an online retailer, but some information is missing. Print the
#total number of missing values in each column of the data.

                     type    country  price  rating
style                                               
alvarinho           white   portugal  18.99     4.2
blanc de blanc  sparkling     france    NaN     3.8
cabernet              red  argentina  14.90     4.0
gavi                white      italy  13.56     NaN
malbec                red  argentina  19.04     4.2

#Complete the code to return the output

missing_total_by_column = wine.isna().sum()

print(missing_total_by_column)

In [ ]:
#Which of the following DataFrame methods will generate various summary statistics, excluding NaN values?

#.summarize()

#.info()

#.summary()

#.describe()*

In [ ]:
#You work for a second hand car sales company, and they want to know the relationship between the age and the value so that they
#can estimate the best price to sell their cars at. Create a plot to show the relationship, identifying the emissions level by
#changing the color of each point. The valuation data is previewed below.

    age emissions   mpg  value
0    15       low  23.1   3047
1     8       low  10.4  15428
2     4      high  15.4  24973
3    10      high  31.0   4638
4     1       low  30.2  19303

#Complete the code to return the output

import matplotlib.pyplot as plt
import seaborn as sns

sns.scatterplot(x = "age", y = "value", hue = "emissions", data = valuation)

plt.show()

In [ ]:
#The steam data represents the average temperature (temp) and the average steam usage (usage) of a steam driven turbine per
#month. Create a scatterplot of usage vs temp.

#Complete the code to return the output

import matplotlib.pyplot as plt
import seaborn as sns


ax = sns.scatterplot(data=steam, 
                    x="temp", 
                    y="usage")

plt.show()

In [ ]:
#The chess DataFrame contains information about the top female chess players around the world. A preview of the DataFrame is
#shown. Set the index of the DataFrame to be the column containing the Fide id of the players.

    Fide id Name.               Federation Year_of_birth     Title
0   700070  Polgar, Judit              HUN          1976        GM
1   8602980 Hou, Yifan                 CHN          1994        GM
2   5008123 Koneru, Humpy              IND          1987        GM
3   4147103 Goryachkina, Aleksandra    RUS          1998        GM
4   700088  Polgar, Susan              HUN          1969        GM

#Complete the code to return the output

chess = chess.set_index('Fide id')

print(chess.head())

In [1]:
#Create a swarm plot of value as a function of measurement. Use the color to indicate the species. The data is contained in the
#iris DataFrame.

--iris
      species    measurement   value
0     setosa     sepal_length  5.1
1     setosa     sepal_length  4.9
...
598   virginica  petal_width   4.6
599   virginica  petal_width   5.0

#Complete the code to return the output

import matplotlib.pyplot as plt
import seaborn as sns

ax = sns.swarmplot(x="measurement", 
                   y="value", 
                   hue="species", 
                   data=iris)

plt.show()

In [ ]:
#Following a trial of a new treatment, you wish to create a plot of the change over the time of the trial (week) of the patient
#response (resp). The patient data is shown below.

   week  resp
0     0    91
1     1    89
2     2    82
3     3    75
4     4    59
5     5    53

#Complete the code to return the output

import matplotlib.pyplot as plt
import seaborn as sns

sns.lineplot(x = "week", y = "resp", data = patient)

plt.show()

In [ ]:
#Consider the Pandas DataFrame df below.

     gh owner language      repo  stars
0  pandas-dev   python    pandas  17800
1   tidyverse        R     dplyr   2800
2   tidyverse        R   ggplot2   3500
3      has2k1   python  plotnine   1450

#Complete the code to return the output

print(df.iloc[0:2])

In [ ]:
#Below is a sample of closing prices for Amazon stock during February of 2013, contained in the DataFrame amazon. Within the
#DataFrame are two columns: date, which gives the day in date format, and the corresponding close price for each day. Create a
#line plot of this data.

      date      close
2013-02-08    261.950
2013-02-11    257.210
2013-02-12    258.700
2013-02-13    269.470
2013-02-14    269.240

#Complete the code to return the output

import matplotlib.pyplot as plt
import seaborn as sns

sns.lineplot(
    x='date', 
    y='close', 
    data=amazon)

plt.xticks(rotation = 45)
plt.show()

In [ ]:
#Calculate the inter-quartile range of the age of 100 customers who have recently bought products from your website.

#Complete the code to return the output

from scipy import stats

iqr_age = stats.iqr(age)

print(iqr_age)

In [ ]:
#Two of the columns in the heart DataFrame have very long names. Rename the columns using the provided dictionary.

#Complete the code to return the output

import pandas as pd

column_names = {
    'slope_of_peak_exercise_st_segment': 'slope',
    'fasting_blood_sugar_gt_120_mg_per_dl': 'fbs' 
}

heart_clean = heart.rename(columns=column_names)
print(heart_clean.head())

In [ ]:
#From the Pandas DataFrame df shown below return all females whose salary is greater than 5000.

     first name   gender     salary  
0         Linda   female       3400  
1         Steve     male       5000 
2         Henry     male      12400
3          Sara   female       7600  

#Complete the code to return the output

result = df[(df['salary'] > 5000) & (df["gender"] == "female")]
print(result)

In [ ]:
#Using the food DataFrame, previewed below, print the row for the item with the largest amount of energy per 100g.

               energy  protein  carbohydrate
item                                        
waffles           200     4.29         35.71
tacos             180    10.94         23.44
lasagne           188    11.76         10.59
croissant         343     5.71         58.57
chicken salad     110     5.00          8.00
thai curry        106     3.18         11.66

#Complete the code to return the output

largest = food[food['energy'] == food['energy'].max()]

print(largest)

In [ ]:
#Initialize a 2x2 grid of facets using the tips dataset. The time variable should determine the number of columns and the smoker
#variable should determine the number of rows.

#Complete the code to return the output

import matplotlib.pyplot as plt
import seaborn as sns

g = sns.FacetGrid(
            tips, 
            col="time", 
            row="smoker"
            )

plt.show()

In [ ]:
#Calculate the inter-quartile Range for the pH numpy array.

#Complete the code to return the output

from scipy import stats
IQR = stats.iqr(pH)
print(IQR)

In [ ]:
#The wine DataFrame, whose first few rows are shown below, contains ratings information for a number of wines on offer from an
#online retailer. Create a pivot table to show the maximum rating, for each type and country.

                     type    country  price  rating
style                                               
alvarinho           white   portugal  18.99     4.2
blanc de blanc  sparkling     france    NaN     3.8
cabernet              red  argentina  14.90     4.0

#Complete the code to return the output

import numpy as np

max_ratings = wine.pivot_table(values='rating', 
                              index='country', 
                              columns='type', 
                              aggfunc=np.max, 
                              fill_value=0, 
                              margins=True)

print(max_ratings)

In [ ]:
#You work for a second hand car sales company, and they want to know the relationship between the age and the value so that they
#can estimate the best price to sell their cars at. The valuation data is previewed below. Update the plot to use an x
#(lowercase), as the points.

    age emissions   mpg  value
0    15       low  23.1   3047
1     8       low  10.4  15428
2     4      high  15.4  24973
3    10      high  31.0   4638
4     1       low  30.2  19303

#Complete the code to return the output

import matplotlib.pyplot as plt
import seaborn as sns

sns.scatterplot(x = "age", y = "value", marker = "x", data = valuation)

plt.show()

In [ ]:
#Select the three rows having the smallest values in the population column.

                population  GDP
Brics           210354000   186818
Russia          146780720   1657290
India           1387297452  2718732
China           1433783686  13368073
South Africa    58558270    368135

#Complete the code to return the output

print(df.nsmallest(3, 'population'))

In [ ]:
#For each color of star in the DataFrame df, calculate the minimum, maximum, and mean of the temp and radius columns.

     color              temp         radius
0     Blue             23092        0.01040
1      Red              3042         0.1542
2      Red              2600         0.1020
3     Blue             10930       25.00000
4      Red              1939         0.1030

Complete the code to return the output

import pandas as pd

print(stars.groupby("color")[['temp', 'radius']].
      agg(['min', 'max', 'mean']))

In [ ]:
#Using the food DataFrame, previewed below, print the rows where protein per 100g is between, but not including, 4 and 10.

               energy  protein  carbohydrate
item                                        
waffles           200     4.29         35.71
tacos             180    10.94         23.44
lasagne           188    11.76         10.59
croissant         343     5.71         58.57
chicken salad     110     5.00          8.00
thai curry        106     3.18         11.66

#Complete the code to return the output

protein = food[(food['protein'] > 4) & (food['protein'] < 10)]

print(protein)

In [ ]:
#Calculate the inter-quartile range of the age of 100 customers who have recently bought products from your website.

#Complete the code to return the output

import pandas as pd 

Q1 = df['age'].quantile(0.25)
Q3 = df['age'].quantile(0.75)

print(Q3 - Q1)

In [ ]:
#Create a scatterplot of Score as a function of GDP per capita. Use the color to indicate the level of Generosity. The data is
#contained in the happiness DataFrame.

#Complete the code to return the output

import matplotlib.pyplot as plt
import seaborn as sns

ax = sns.scatterplot(x="GDP per capita", y="Score", hue="Generosity", data=happiness)

plt.show()

In [ ]:
#Plot the monthly dam level height contained in the dam_level DataFrame.

--dam_level
date        level
2019-01-01    48.6
2019-02-01    46.7
2019-03-01    44.8

#Complete the code to return the output

import matplotlib.pyplot as plt
import seaborn as sns

sns.lineplot(x='date', y='level', data=dam_level)

plt.xticks(rotation=45)
plt.show()

In [ ]:
#Create a scatterplot of mpg vs age and color it based on the emissions categorical variable.

    age emissions   mpg  value
0    15       low  23.1   3047
1     8       low  10.4  15428
2     4      high  15.4  24973
3    10      high  31.0   4638
4     1       low  30.2  19303

#Complete the code to return the output

import matplotlib.pyplot as plt
import seaborn as sns

ax = sns.scatterplot(x = 'age', 
               y = 'mpg', 
               hue = 'emissions',
               data=valuation)

plt.show()

In [ ]:
#You have conducted an A/B test to see whether more users will buy more items from your online shop. Create a plot to show the
#number of users who bought/didn't buy items based on whether they were in the control or treatment groups. A sample of the
#experiment data is shown below.

    user      group  buy  items
0    830    Control  yes     10
1    252    Control   no      0
2    218    Control  yes      7
3    313  Treatment   no      0
4    804  Treatment  yes      4

#Complete the code to return the output

import matplotlib.pyplot as plt
import seaborn as sns

sns.countplot(x = "buy", hue = "group", data = experiment)

plt.show()

In [ ]:
#You have conducted an A/B test to see whether more users will buy more items from your online shop. Create a horizontal bar
#plot to show the overall number of users who bought/didn't buy items. A sample of the experiment data is shown below.

    user      group  buy  items
0    830    Control  yes     10
1    252    Control   no      0
2    218    Control  yes      7
3    313  Treatment   no      0
4    804  Treatment  yes      4

#Complete the code to return the output

import matplotlib.pyplot as plt
import seaborn as sns

sns.countplot(y = "buy", data = experiment)

plt.show()

In [ ]:
#Calculate the inter-quartile Range for the pH numpy array.

#Complete the code to return the output

import numpy as np
IQR = np.percentile(pH, 75) - np.percentile(pH, 25)
print(IQR)

In [ ]:
#The chess dataset contains information about the top female chess players around the world. A preview of the dataset is shown
#below. Retrieve the data of the player with Fide id equal to 5008123

                           Name    Federation
Fide id
4402421    Chirivi C, Angie Lizeth        COL
3511170      Perez Sanchez, Gretel        CUB
5038049             Kulkarni Juily        IND
5202744        Secopito, Catherine        PHI
5700701           Marmono, Roslina        MAS

#Complete the code to return the output

fide_id = 5008123

print(chess.loc[fide_id])

In [ ]:
#Subset the Pandas DataFrame df using loc to return the second, third and fourth rows.

      Month  Count
one    Jan     52
two    Feb     29
three  Mar     46
four   Apr     31
five   May     42

#Complete the code to return the output

print(df.loc[['two', 'three', 'four']])

In [ ]:
#You have sales data for the years 2018 and 2019. Create a new DataFrame, sales_2019, that contains data from 2019 only.

>>>sales['Year'].value_counts()
2019    36
2018    36
Name: Year, dtype: int64

#Complete the code to return the output

sales_2019 = sales[sales['Year'] == 2019]

print(sales_2019.head())